Revit 2026 API

# BendingDetailSegmentLengthsDisplayOptions Enumeration

---

Describes if the segment lengths are represented using dimensions or just as text.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum BendingDetailSegmentLengthsDisplayOptions
```
```vb
Public Enumeration BendingDetailSegmentLengthsDisplayOptions
```
```cpp
public enum class BendingDetailSegmentLengthsDisplayOptions
```
```fsharp
type BendingDetailSegmentLengthsDisplayOptions
```

| Member name | Value | Description |
| --- | --- | --- |
| Dimension | 1 | Display as dimensions |
| Text | 0 | Display as texts |

#### Reference

Autodesk.Revit.DB.Structure Namespace